 ///////////////////////////////////////////////////////////////  [1]  ///////////////////////////////////////////////////////////

 

const age = prompt("Сколько тебе лет? (if/else/else if)")

if (age >= 18 && age < 30 && age != 30) {
     alert(`Тебе ${age}, ты уже совершеннолетний! Поздравляю!`)
} else if (age == 14) {
     alert(`Тебе ${age}, ты еще шкет, паспорт уже получил?`)
 } else if (age > 14 && age < 18 && age != 18) {
     alert(`Тебе ${age}, ты все тот-же шкет, но с паспортом!`)
 } else if (age > 30) {
     alert(`Тебе ${age}, постарел, с кем небывает!`) 
 } else {
     alert(`Тебе ${age}, ты слишком мал, закрой вкладку! `)
 }
 
    console.log(`Задание №1, сколько тебе лет, Указали: ${age}, выполнился!`)


///////////////////////////////////////////////////////////////  [1.1]  ///////////////////////////////////////////////////////////



const ageTern = prompt(`Сколько тебе лет?(? , :)`)

const result = ageTern > 18
    ? alert(`Ты совершеннолетний! Поздравляю!`)
    : ageTern == 18 
    ? alert(`Ты уже модешь вводить автомобиль!`)
    : alert(`Ты еще пиздюк!`) 

    console.log(`Задание №1.1, сколько тебе лет, тернарный оператор, Указали: ${ageTern}, выполнился!`)

///////////////////////////////////////////////////////////////  [2]  ///////////////////////////////////////////////////////////

const dayWeek = prompt("Укажи цифру дня недели от 1 до 7")
   
switch(dayWeek) {
    case `0`:
        alert("Такого дня в недели нет!")
        break;

    case `1`:
        alert("1-й День недели, Понедельник! Ура, работа!")
        break;
    
    case `2`:
        alert("2-ой День недели, Вторник! Все туда же, на работу!")
        break;

    case `3`:
        alert("3-ий День недели, Среда! Опять, РАбООТАА!")
        break;

    case `4`:
        alert("4-ый день недели, Четверг, мммм работа!")
        break;

    case `5`:
        alert("5-ый день недели, Пятница, ура, выходные!")
        break;

    case `6`:
        alert("6-ой день недели, Суббота, выходной, релакс!")
        break;

    case `7`:
        alert("7-ой день недели, Воскресенье! Выходной, с депрессией, ведь завтра на РААББОТу!")
        break;
    default: "Такого нету!"
   }
        console.log(`Задание №2. Дни недели, Указали: ${dayWeek}, выполнился!`)

   ///////////////////////////////////////////////////////////////  [3]  ///////////////////////////////////////////////////////////
   console.log(`Задание №3, выполнилось, цикл от 1 до 10!`)
   
   for (let i = 1; i <= 10; i++) { 
    console.log(i);
   }
        